fish_name = """Аба-аба
Абрамитес мраморный
Австралийский анчоус
Австралийский колючепер
Австралийский шишечник
Адамуссиус
Адский вампир
Азиатская зубатка
Акара голубовато-пятнистая
Акарихтис Хекеля
Акула
Акула-квагга
Акула азиатская кунья
Акула белая
Акула белоглазая
Акула белоперая
Акула большеносая
Акула большеротая
Акула галапагосская
Акула гигантская
Акула гладкозубая
Акула гренландская
Акула губастая
Акула длиннокрылая
Акула звездчатошипая
Акула зебровая
Акула индонезийская
Акула исландская
Акула китовая
Акула копьезубая
Акула коромандельская
Акула мадагаскарская
Акула мальгашская
Акула мелкозубая
Акула Мицукури
Акула мозамбикская бычья
Акула ночная
Акула острозубая
Акула пелагическая лисья
Акула пепельная
Акула песчаная
Акула песчанная
Акула пилозубая
Акула плащеносная
Акула плоскоголовая
Акула рифовая
Акула светлохвостая
Акула светящаяся
Акула свиноглазая
Акула свинья
Акула Сейла
Акула серо-бурая
Акула серо-голубая
Акула сигарная
Акула скульптурная
Акула суповая
Акула темная
Акула темноперая
Акула тигровая
Акула узкозубая
Акула черная
Акула черноперая
Акула шелковая
Акула шершавая
Акула шестижаберная
Акула эполетовая
Акула японская бычья
Акула-бык
Акула-домовой
Акула-лисица
Акула-молот обыкновенная
Акула-Небрия
Акула-нянька короткохвостая
Акула-свинья
Акула-собака
Акулеола черная
Алект вымпельный
Алепизавр
Алеста
Альбула
Американский угорь
Амия
Ампуллярия
Амурская Щука
Амурский Осетр
Амурский Сиг
Анаконда
Ангел лирохвостый
Ангел черноплавничный
Антимора клюворылая
Апистограммова факельная
Аравана серебристая
Аравана черная
Арапаима
Аристохромис Кристи
Аротрон белоточечный
Аротрон колючий
Аррип большой
Аррип малый
Архитеутис
Асаги
Аспатария марнои
Аспатария пифлоидная
Астронотус глаздчатый
Атлантический Осетр
Аулонокара Бенша
Аулонокара Ньяса
Ауха
Аухеногланис
Афалина
Бабочка малавийская
Багре гури
Багре негро
Багре хигучи
Байкальский осетр
Барабулька
Барамунди
Барракуда
Барракуда тупорылая
Башир
Баяд
Белоглазка
Белуга
Белуга черноморская
Белуха
Белый амур
Бельдюга Андрияшева
Бельдюга восточная
Берикс австралийский
Берш
Бестер
Биара
Бикуда
Бисса
Болотная черепаха
Большая сериола
Большеротый окунь
Большой каранкс
Бонито
Бородавчатка
Бородавчатка красноморская
Бронзовая акула
Бротула многоусая
Брызгун крупнопятнистый
Букцинум
Буртония Фоаи
Бутылконос плоскоголовый
Бутылконос северный
Буффало большеротый
Буффало малоротый
Буффало черный
Быстрянка
Бычеглаз-хамрур
Бычок
Бычок краснозубый
Бычок-кнут
Бычок-цуцик
Бэрардиус Бэрда
Валаамка
Валек
Вариола белокаемчатая
Ваху
Велифер
Венера воздушная
Верхогляд
Веслонос
Владиславия
Вобла
Волосозуб
Волютопсиус каштановый
Ворчун крапчатый
Восточная треска
Восточносибирский хариус
Вунду
Вырезуб
Вьюн
Вьюн амурский
Галаксия пятнистая
Галаксия Тасманская
Галаксия чилийская
Гетеротис
Гигантская акула-молот
Гигантская тридакна
Гигантский головастик
Гигантский карп
Гидромедуза бразильская
Гимносарда
Гитарный скат
Глаукус
Глицимерис приморский
Глосса
Глубинная щука
Глубинный судак
Голавль
Голец альпийский
Голец арктический
Голец белый
Голец Дальнеозерный
Голец дальнеозерский
Голец длинноголовый
Голец Леванидова
Голец носатый
Голец Таранца
Голец узонский
Голец усатый
Голец Черского
Голец чукотский
Голец-кристивомер
Голомянка
Голубая акула
Голубая линкия
Голубой марлин
Голубой тунец
Голый осман
Гольян Лаговского
Гольян Чекановского
Гонатус
Горбуша
Горбуша южноамериканская
Горбыль
Горгасия красноморская
Граммистес шестиполосый
Гребешок бело-розовый
Гребешок исландский
Гребешок коралловый
Гребешок лунный
Гребешок многообразный
Гребешок раскрашенный
Гребешок Свифта
Гребнистый крокодил
Гринда короткоплавниковая
Гринда обыкновенная
Групер Малабарский
Группер белоокаймленный
Группер буропятнистый
Группер желто-синий
Группер индоокеанский малоглазый
Группер Квинслендский
Группер красноротый
Группер крупнопятнистый
Группер малабарский
Группер палевый
Группер таувина
Группер шестиполосый
Губан гребенчатый
Губан колючий
Губан носатый
Губан пятнистый
Губан радужный
Губка-лира
Густера
Даватчан
Даллия
Дасцилл зебровидный
Двухцветная пеламида
Джакунда
Дианема полосатохвостая
Дискус зеленый
Дискус Хеккеля
Дистиходус шестиполосый
Длиннопалый рак
Длинноперый тунец
Длиннорылый полурыл
Долгопер средиземноморский
Дорадо
Дорадо золотой
Дрейссена речная
Дунайский пузанок
Евдошка американская
Евдошка европейская
Единорог расписной
Елец
Елец Сибирский
Елец-андруга
Ерш
Ерш носарь
Ершоватка
Желтопёрый тунец
Желтокрылка
Желтохвост
Желтощек
Жемчужная рыба
Жерех
Жерех-лысач
Зайцеголовый терпуг
Запрора
Звезда-подушка
Зебровый хирург
Зеленушка
Зеленый луциан
Змееголов
Змеиная макрель
Золотистая сериола
Золотистая скорпена
Золотистый линь
Золотой леопард
Зубарик обыкновенный
Зубатка дальневосточная
Зубатка полосатая
Зубатка пятнистая
Зубатка синяя
Идол мавританский
Императорский ангел
Инанга
Иния
Кайман гладколобый
Кайман крокодиловый
Кайман черный
Кайман широкомордый
Калинка
Калкан черноморский
Каллиста короткосифонная
Каллитака Адамса
Каллихт
Калуга
Кальвус
Кальмар гигантский
Кальмар командорский
Кальмар обыкновенный
Кальмар тихоокеанский
Камбала двухлинейная
Камбала двухцветная
Камбала звёздчатая
Камбала зеленая
Камбала кесслера
Камбала морская
Камерония Бургинья
Камнеточец
Кампанго
Камчатский краб
Каракатица лечебная
Каракатица расписная
Каранг золотой
Каранкс бронзовый
Каранкс Гебера
Каранкс черный
Карась золотой
Карась морской
Карась морской чернополосый
Карась серебряный
Карась-барабан
Кардиум реснитчатый
Карп
Карп африканский
Карп голый
Карп зеркальный
Карп индийский
Картофельный группер
Катран
Катран вануатский
Каури-монета
Кашалот
Кашалот карликовый
Кашалот-альбинос
Кашорро краснохвостый
Керчак-яок
Кета
Кефаль алмазная
Кефаль-губач
Кефаль-лобан
Кижуч
Кижуч озерный
Кижуч южноамериканский
Кинжалозуб
Кит бискайский
Кит горбатый
Кит горбатый альбинос
Кит гренландский
Кит карликовый
Кит северный гладкий
Кит серый
Кит синий
Кит синий альбинос
Кит южный гладкий
Кит японский
Китовая акула
Китовая акула - альбинос
Кланкулюс
Клоун танганьикский
Клюворыл
Клюворыл Шепарда
Коаро
Коелатура мозамбикская
Кожистая черепаха
Кои Асаги
Кои-утсури
Кокани
Колоссома
Колючий краб
Колюшка девятииглая
Колюшка трехиглая
Комета
Конголли
Конус березовый
Конус географический
Конус дворцовый
Конус Мильн-Эдвардса
Конус мраморный
Конус письменный
Конус полосатый
Конус текстильный
Коралловый группер
Королева Ньяса
Королева Танганьики
Королевский луциан
Корюшка
Корюшка озерная малоротая
Косатка
Косатка малая
Косаткодельфин
Костерь
Кохаку
Кошачья акула
Краб вельветовый
Краб королевский
Краб красный мангровый
Краб малавийский голубой
Краб монтивагус
Краб Мраморный
Краб сине-красный
Краб снежный
Краб съедобный
Краб танганьикский
Краб-йети
Кракен
Краппи белый
Красное бревно
Красноперка
Красный конгрио
Красный луциан
Креветка северная
Крокодил Джонстона
Крокодил нильский
Крокодил узкорылый
Крупночешуйчатый угай
Крылатка антенновая
Крылатка-зебра
Кряжевая палия
Кудрепер Форстера
Кузовок рогатый
Кузовок-кубик
Кумжа
Кумжа южноамериканская
Кунджа
Кутум
Кэтфиш
Лабеотрофеус обыкновенный
Лабидохромис большой
Лабидохромис Хонги
Лабынкырская мальма
Лабынкырский хариус
Лабынкырский чёрт
Лаванда Мбуна
Лаврак
Лаврак белый
Лаврак полосатый
Лазианциструс
Ламна
Ледяная рыба
Лемонема
Ленок
Ленский пескарь
Ленский хариус
Леопардовый группер
Лепоринус зебровый
Лепоринус фредерика
Летрин длиннорылый
Летрин небесный
Лещ
Лещ Восточносибирский
Лещ морской
Лещ морской белый
Лещ морской кинжальный
Лещ черный южный
Ликодонт яванский
Лиманда длиннорылая
Лиманда желтохвостая
Линофрина индийская
Линь
Лихия
Логгерхед
Лососевая акула
Лосось
Лосось дунайский
Лосось Каспийский
Лосось Кларка
Лосось южноамериканский
Лоцман
Луварь
Лудога
Лудожная палия
Лунник
Луфарь
Луциан Бохар
Луциан горбатый
Лягушка
Лягушка нильская
Лягушка роющая
Лямбис подагрический
Мавританский клоун
Мазутный двухголов
Мако длинноплавниковый
Макома широкая
Макрель голубая
Макропинна
Макруронус новозеландский
Макрурус вооруженный
Мактра китайская
Мактра сахалинская
Мактромерис изменчивый
Малабарский хоплиас
Маллисквама
Малоглазый макрурус
Малый полосатик
Мальма
Мангровый джек
Мандаринка
Манта
Манта рифовая
Масляная рыба
Матамата
Мбамба
Мбенга
Мегалодон
Мелания песчаная
Меланохромис
Мелкозубый пилорыл
Мелкочешуйчатый краснопер
Мелкочешуйчатый угай
Мена пятнистая
Менёк
Менхэден бразильский
Мерланг
Мерценария Стимпсона
Метиннис пятнистый
Мешкорот
Мидия
Микижа
Микижа чилийская
Миксина атлантическая
Милеус ленточный
Милоссома килебрюхая
Минога морская
Минога огайская
Минога сибирская
Минтай
Многопёр Эндлихера
Мойва
Моллюск
Мольва
Монгольский краснопер
Мормир бутылконосый
Мормиропс угревидный
Морская звезда красношипая
Морская лисица
Морская очковая свинья
Морская свинья беспёрая
Морская свинья Далля
Морская свинья обыкновенная
Морская свинья очковая
Морская свинья тихоокеанская
Морская свянья обыкновенная
Морская собачка
Морской ворон
Морской еж
Морской монах
Морской орел
Морской финик
Морской черт
Моторо
Мригал
Муксун
Мурджан
Мурена гигантская
Мурена европейская
Мурена желторотая
Мурена ленточная
Мурена перечная
Мурена-зебра
Муреная ячеистая
Мускулус
Мутела
Мухтельский карась
Налим
Налим средиземноморский
Нанностом Бекфорда
Нарвал
Неалот
Нейва
Нельма
Необерингиус Фрилея
Нереис
Нерка
Нерка карликовая
Нерпа байкальская
Нильский окунь
Нимбохромис полистигма
Новозеландская мерлуза
Нодулария боеми
Носатая энгидрина
Носорог безрогий
Носорог однорогий
Носорог пятнистый
Обыкновенный краб-стригун
Озерная форель
Озерный гольян
Оксимонокант длиннорылый
Окунь
Окунь алеутский
Окунь большеглазый
Окунь вилохвостый
Окунь гладкий
Окунь золотой
Окунь каменный
Окунь красноглазый
Окунь малоротый
Окунь малый
Окунь морской золотистый
Окунь морской норвежский
Окунь песчаный
Окунь прибрежный
Окунь пятнистый
Окунь северный морской
Окунь танганьикский
Окунь ушастый
Окунь-клювач
Окунь-пират
Омар голубой
Омар европейский
Омар норвежский
Омуль
Омуль Байкальский
Омуль баргузинский
Омуль маломорский
Омуль посольский
Омуль северобайкальский
Омуль селенгинский
Омуль чивыркуйский
Оникия
Оренжи Огон
Ореохромис Каронга
Ореховидка тонкая
Оринокский крокодил
Орфа
Осетр
Осетр адриатический
Осетр белый
Осетр Восточносибирский
Осетр тихоокеанский
Осетр тупорылый
Острорылый крокодил
Острорылый ленок
Осьминог Думбо
Осьминог обыкновенный
Осьминог семирукий
Офиура полосатая
Офтальмотиляпия носатая
Павлиний группер
Павлиний окунь королевский
Павлиний окунь ленточный
Павлиний окунь-бабочка
Пагелл красный
Пагр красный
Пайара
Пака
Палия
Палия американская
Палия южноамериканская
Палтус американский
Палтус атлантический
Палтус Белокорый
Палтус синекорый
Палтус стрелозубый
Пальмовый вор
Панцирник длиннорылый
Панцирник миссисипский
Парусник
Патагонский гребешок
Патагонский клыкач
Патагонский лобстер
Пеламида атлантическая
Пеленгас
Пелядь
Пенжинский омуль
Переславская ряпушка
Перечный слизняк
Перка
Перонидия жилковатая
Персидский осетр
Перуанская макрель
Перуанская сардина
Перуанская сериолелла
Перуанская ставрида
Перуанский анчоус
Пескарь
Пестрый конь
Пестрый толстолобик
Петушок
Пигоплит
Пикша
Пилонос австралийский
Пилонос японский
Пинагор
Пираиба
Пиракатинга
Пиранья вымпельная
Пиранья крапчатая
Пиранья краснобрюхая
Пиранья обыкновенная
Пиранья ромбовидная
Пиранья стройная
Пирапитинга
Пирапутанга
Пирарара
Пираруку
Пиратский клад
Плавун южный
Платакс-нетопырь
Платинум Огон
Плиотрема
Плоскоголов бахромчатый
Плоскоголов пятнистый
Плотва
Подкаменщик
Подлещик
Подуст
Полиптер
Поллак
Поллимир Исидора
Полосатая камбала
Полосатик Брайда
Полосатик Идена
Полосатик карликовый
Полосатик Омуры
Полосатик южный
Полосатый марлин
Полярная акула
Помакант рябой
Попока
Пресноводный краб
Приморский гребешок
Принцесса Бурунди
Промикропс
Протоптер бурый
Протоптер малый
Протоптер мраморный
Прудовик
Псевдотрофеус Демасони
Птеригоплихт парчовый
Пузанок
Пузанок северокаспийский
Пустая бочка
Путассу северная
Пыжьян
Пятиугольный волосатый краб
Пятнистая озерная лягушка
Пятнистый воббегонг
Пятнистый рак
Пятнистый сладкогуб
Радужная вариола
Радужная форель
Рак
Рак красный флоридский
Рак сигнальный
Рапана
Рапана венозная
Рваный сапог
Ремнезуб атлантический
Ремнезуб Блэнвиля
Ремнезуб Грея
Ремнезуб командорский
Ремнезуб перуанский
Рипус
Робало
Рогатка
Розовый луциан
Ротан
Ручьевая форель
Рыба лира
Рыба луна короткая
Рыба меч
Рыба-бекас
Рыба-белка
Рыба-еж длинношипая
Рыба-кабан трехполосая
Рыба-капля
Рыба-лиса
Рыба-луна
Рыба-луна короткая
Рыба-луна овальная
Рыбальдо
Рыба-лягушка
Рыба-Наполеон
Рыба-ремень
Рыба-сабля
Рыба-тряпка
Рыбец
Ряпушка
Саблезуб
Сазан
Сайда
Сайка
Сайра атлантическая
Саратога
Сарган
Сарган крокодиловый
Сардина европейская
Сардина танганьикская
Сарпа
Сахалинская лиманда
Сахалинский осетр
Свинья аргентинская
Свистулька голубопятнистая
Сева
Севанская форель
Северный клювач
Севрюга
Сейвал
Сельдь американская
Сельдь атлантическая
Сельдь волжская
Сельдь Каспийская
Сельдь тихоокеанская
Сельдь чёско-печорская
Сельдь чёшско-печорская
Сельдяной король
Семапрохилодус
Семга
Семга камчатская
Семутунду
Сердеронг чернопятнистый
Сердцевидка съедобная
Серое бревно
Серрипес замечательный
Серцевидка
Сиб.голец-усач
Сибирская ряпушка
Сибирский подкаменщик
Сиг
Сиг-Xадары
Сиган звездчатый
Сиган струйчатый
Сиган яванский
Сиг-востряк
Сима
Сима южноамериканская
Синекольчатый осьминог
Синеплавниковый каранкс
Синеполосый луциан
Синец
Синодонтис вуалевый
Скалозуб бурый
Скалярия леопольда
Скар двухцветный
Скар рубиновый
Скар широколобый
Скат
Скат - кукушка
Скат акулий
Скат акулохвостый
Скат гладкий
Скат Йенсена
Скат колючий
Скат короткохвостый
Скат круглый
Скат лучевой
Скат мозаичный
Скат Монтегю
Скат полярный
Скат пятнистый
Скат тэниура лимма
Скат-кукушка
Скат-орляк австралийский
Скат-орляк белоточечный
Скат-орляк изысканный
Скат-орляк пятнистый
Скат-торпедо электрический
Скорпенопсис дьявольский
Скрипун
Скумбрия атлантическая
Сладкогуб гигантский
Собачка речная
Солидус
Солнечник обыкновенный
Солнечник синежаберный
Сом
Сом Амурский
Сом жирафовый
Сом малавийский
Сом мраморный
Сом Солдатова
Сом Суруби
Сом танганьикский
Сом ширентис
Сом электрический
Сомалийская рыба-бабочка
Сомик американский
Сомик голубой
Сомик желтый
Сомик канальный
Сомик леопардовый
Сомик оливковый
Сомик черный
Сомик-кукушка
Сом-плоскоголовик
Спинорог бело-зеленый
Спинорог голубой
Спинорог голубоперый
Спинорог желтомордый
Спинорог заплаточный
Спинорог золотоплавниковый
Спинорог краснозубый
Спинорог крупнопятнистый
Спинорог оранжевополосый
Спинорог Пикассо
Спинорог позолоченный
Спинорог расписной
Спинорог розовохвостый
Спинорог точечный
Сплэйк
Старая покрышка
Стерлядь
Стерлядь Сибирская
Стигматохромис вуди
Странствующий группер
Стройный группер
Стромбус волнистый
Стромбус королевский
Судак
Судак канадский
Сферомия пятнистая
Сфирена мелкочешуйная
Таедо
Таймень
Тамбаку
Тарань
Тартаруга
Тасманский краб
Тасманский пескарь
Тасманский рак
Тауматихт Акселя
Тегу
Темно-бурый луциан
Терпуг бурый
Терпуг одноперый
Терпуг Стеллера
Тигровая рыба нильская
Тигровая рыба обыкновенная
Тигровая рыба танзанийская
Тилозур красноморский
Тиляпия галилейская
Тиляпия Зилля
Тиляпия красногрудая
Тиляпия мозамбикская
Тиляпия нильская
Тифобия
Тихоокеанская минога
Тихоокеанская навага
Тихоокеанская песчанка
Толстолобик
Томатный группер
Тонкохвостый налим
Тонна гигантская
Тонна ленточная
Топь
Травяной краб
Тракакса
Треска атлантическая
Тригла желтая
Троегуб
Трофеус звездчатый
Тугун
Тукунаре
Тунец индо-тихоокеанский
Тунец макрелевый
Тунец малый
Тунец полосатый
Тунец скумбриевидный
Тунец южный
Тюрбо
Уару
Убанги
Угольная рыба
Угорь
Угорь короткоребристый
Угорь собачий
Угорь электрический
Удильщик Джонсона
Удильщик Коммерсона
Узо-угай
Уклейка
Украинская минога
Улитка
Усач
Усач Валецкого
Усач днепровский
Усач Итальянский
Уссурийская востробрюшка
Уссурийская касатка
Устрица
Утконос
Утсури
Фахака
Фея перламутровая
Фикус изящный
Финвал
Финта
Флейторыл
Форель апачей
Форель Бива
Форель Дональдсона
Форель золотая
Форель мраморная
Форель остроголовая
Форель тигровая
Фромия элегантная
Хапаку
Хараки
Хариус
Хариус байкальский белый
Хариус байкальский черный
Хариус камчатский
Хариус Сибирский
Хвостокол кольчатый
Хвостокол Мацубары
Хвостокол широкохвостый
Хемиодопсис
Хемихромис-красавец
Хендфиш
Химера европейская
Хирург белогрудый
Хирург желтоплавничный
Хирург флаговый
Хирург-Ахиллес
Храмуля
Хризиптера сине-желтая
Целакант
Центрина Австралийская
Цетрина австралийская
Цитарина обыкновенная
Цихлазома мезонаута
Цихлида гигантская
Цихлида Ливингстона
Цихлида тупорылая
Цихлида-дельфин
Цихлида-колибри
Чавыча
Чавыча южноамериканская
Чебак
Черепаха
Черепаха зеленая
Черепаха саванная
Черноморская кумжа
Черноморская сельдь
Черноморская шемая
Чернохвостый луциан
Черный амур
Черный краппи
Черный Лещ
Черный макалор
Черный малакост
Черный марлин
Черный нож
Четырехугольный волосатый краб
Чехонь
Чешуеед
Чешуйчатник
Чилийская пеламида
Чилим
Чир
Чоп
Чукучан
Шабути
Шамбардия Валберга
Шантарская микижа
Шашень
Шемая
Шильб полосатый
Шип
Шипощёк длинноперый
Широколобка красная
Широколобка темная
Шортбилл
Шпрот европейский
Шпрот танганьикский
Щука
Щука красноперая
Щука травяная
Щука черная
Щука-Маскинонг
Щучка Хьюжета
Элагат
Эолидия
Эферия эллиптическая
Южная мальма
Южная путассу
Ябби
Яго Гаррика
Язь
Якутский голец
Якутский карась
Якутский осетр
Ямабуки Огон
Японская макрель
Японский анчоус
Японский краб-стригун
Японский мохнаторукий краб
Ящерица каймановая
Ящероголов красный
Скат Аддисона
Акула австралийская головастая
Акула щелеглазая
Гримпотевтис тихоокеанский
Акула-пилохвост
Акула надувающаяся
Амфитретус пелагический
Дораб
Кит сельдяной
Мобула японская
Уролоф полосатый
Кардинал
Минога каспийская
Подкаменщик пестроногий"""